Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.SectionNameKey
A parameter in structural families which allows for family type identification.
This will be used for data mapping during model exchange with another program, namely Advance Steel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015